insert into med.job_titles (name)
values
    ('Главный врач'),
    ('Терапевт'),
    ('Оториноларинголог'),
    ('Лаборант');


insert into med.doctors (last_name, first_name, middle_name, job_title_id, date_employed)
values
    ('Иванов', 'Петр', 'Семенович', 2, '2001-12-15'),
    ('Семенова', 'Мария', 'Васильевна', 1, '2011-10-20'),
    ('Петренко', 'Инна', 'Игнатьевна', 3, '2022-01-01'),
    ('Пролджэ', 'Тимур', 'Ефимович', 2, '1999-03-01'),
    ('Перов', 'Фома', 'Рустамович', 1, '1997-09-16');


insert into med.clinics (full_name, short_name, address, chief_doctor_id)
values
    ('ОГАУЗ Холмская центральная больница', 'ХЦБ', 'г. Холимск, пр. Ленина, стр. 1', 2),
    ('Фельдшерский пункт д. Кудыкино', 'ФП Кудыкино', 'д. Кудикино, ул. Центральная, д. 3', 4),
    ('ОГАУЗ Тридевяткинская районная больница', 'ТРБ', 'с. Тридевяткино, ул. Новая, стр. 2/1', 5);


insert into med.doctor_clinics (doctor_id, clinic_id)
values
    (1, 1), (2, 1), (3, 1), (4, 2), (5, 3);


insert into med.patients (last_name, first_name, middle_name, gender, dob, phone)
values
    ('Фываев', 'Прол', 'Дормидонтович', 'м', '1940-06-01', '89001231234'),
    ('Смитова', 'Василиса', 'Васильевна', 'ж', '1975-08-25', '89001112233'),
    ('Орпав', 'Тим', 'Иванович', 'м', '2001-03-31', '89001231111');


insert into med.diagnoses (code, "name")
values
    ('МКБ--1', 'ОРВИ'),
    ('МКБ--2', 'Грипп'),
    ('МКБ--3', 'Дальнозоркость'),
    ('МКБ--4', 'Тугоухость');


insert into med.patient_visits (patient_id, doctor_id, clinic_id, visit_date, complaints, exam, recommend)
values
    (1, 4, 2, '2010-10-15', 'плохо слышит', 'набл двустор наруш слуха', 'обсл у ЛОР в ХЦБ'),
    (1, 3, 1, '2010-10-30', 'плохо слышит', '5м - 0%, 2м - 30%', 'слуховой аппарат'),
    (2, 1, 1, '2015-02-09', 'плохо видит - руки короткие', 'прав - 70%, лев - 75%', 'очки для чтения'),
    (3, 1, 1, '2021-09-04', 'кашель, насморк', 'темп 37.5, покрасн горла', 'Аспирин, сниж нагрузок'),
    (2, 1, 1, '2021-09-06', 'кашель, слабость', 'темп 37.8, учащен сердцеб, покрасн горла', 'Аспирин, постельн режим');


insert into med.patient_visit_diag (visit_id, diag_id)
values
    (1, 4), (2, 4), (3, 3), (4, 1), (5, 1), (5, 2);
